#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.main: Refreshing state... [id=83a8f09c28b7a40427566200394ed7bb67d6b82f]
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0yODY1NDVlZS1jODllLTRkZDEtYWNmYy04MmNhNTJjN2JkMGM7b2JqZWN0SWQ9NmQ4MDUwYzQtZjI3ZC00MGYzLTg4YjAtOWFkMjU2OTQ4ZTE5O3N1YnNjcmlwdGlvbklkPWU2NzFmMjNiLWE3ODktNDliZi1iYTQzLWRjY2U5ZTA1ZjUxZjt0ZW5hbnRJZD1hYmIwMjJkMy05NDc5LTRmOTYtOTZhMy04MzAzMzQ4Y2NkYzE=]
data.azurerm_resource_group.example: Read complete after 0s [id=/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                   = "example-machine" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                            = "example-machine" -> "example-machine-pr" # forces replacement
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "6aba4f30-7054-4d4f-a398-8105e14d529b" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (14 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "example-machine_OsDisk_1_63b2645ee86e47a087857280774e3405" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @sikebe-ms, Action: `pull_request`*